#+TITLE: C语言笔记
#+AUTHOR: Micky Ching
#+OPTIONS: H:4 ^:nil
#+LATEX_CLASS: latex-doc
#+PAGE_TAGS: clang

*** 结构体
宏 =offsetof(class, member)= 可用于计算成员偏移量，
但是这个宏其实是有很多限制的，比方不能对结构体中的压缩位字段计算。

如果将尾部成员定义为0长数组的话，
计算结构体大小时其对应成员长度按0计入。
#+BEGIN_SRC cpp :exports both
#include <stdio.h>
struct zero_only {
    char str[0];
};
struct zero_tail {
    int count;
    char str[0];
};
int main(int argc, char *argv[])
{
    printf("%d -> %d\n", sizeof(struct zero_only), sizeof(struct zero_tail));
    return 0;
}
#+END_SRC

#+RESULTS:
: 0 -> 4

